In [850]:
import pandas as pd

In [851]:
df = pd.read_csv("Jobs.csv")
df

,Company,Title,Location,Type,level,Salary,Requirment,Facilities,Country,cluster,x0,x1,classe
0,SGS,clinical data analyst,"Richardson, TX, United States",Full Time,Junior,48,computer science data quality genetics mathema...,NaN,United States,Data Visualization and Business Analytics,0.096575,0.077781,Data Visualization and Business Analytics
1,Ocorian,data analyst,"Ebène, Mauritius",Full Time,Junior,48,agile data management finance security,NaN,NaN,Data Visualization and Business Analytics,-0.008168,0.143837,Data Visualization and Business Analytics
2,Bosch Group,application developer data analyst,"Nonantola, Italy",Full Time,Junior,48,engineering industrial oracle power bi r r,NaN,Italy,Data Visualization and Business Analytics,0.212054,0.104518,Data Visualization and Business Analytics
3,Publicis Groupe,data engineer full time public sector,"Arlington, VA, United States",Full Time,Intermediate,108,aws azure computer science consulting dataflow...,flex hours flex vacation parental leave unlimi...,United States,Cloud Computing and Data Science,-0.173533,-0.186278,Cloud Computing and Data Science
4,ServiceNow,data scientist,"Kirkland, Washington, United States",Full Time,Senior,184,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Machine Learning and Computer Vision,0.403370,-0.192080,Machine Learning and Computer Vision
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2595,CCRi,application integration engineer computer visi...,"Chantilly, Virginia, United States",Full Time,Intermediate,113,agile angular apis architecture aws azure,k matching career development flex hours flex ...,United States,Cloud Computing and Data Science,-0.247856,-0.327857,Cloud Computing and Data Science
2596,Publicis Groupe,associate data science,"New York City, United States",Full Time,Intermediate,106,bayesian classification clustering data analys...,career development health care,United States,Machine Learning and Computer Vision,0.238787,0.020648,Machine Learning and Computer Vision
2597,DoorDash,software engineer machine learning intelligence,"Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior,176,computer science data analysis engineering exc...,k matching career development equity insurance...,New York,Data Visualization and Business Analytics,0.134893,0.079257,Data Visualization and Business Analytics
2598,Western Digital,data scientist college graduate,"Biñan, Philippines",Full Time,Junior,39,apis clustering computer science data visualiz...,career development,Philippines,Machine Learning and Computer Vision,0.139047,-0.149278,Machine Learning and Computer Vision
2599,ATB Financial,data scientist,"Edmonton, Alberta, Canada",Full Time,Junior,39,computer science data analytics data mining ec...,career development startup environment,Canada,Data Visualization and Business Analytics,0.023060,0.128025,Data Visualization and Business Analytics

In [852]:
df.dropna(inplace=True)

In [853]:
df.drop_duplicates(inplace=True, ignore_index=True)

In [854]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1960 entries, 0 to 1959
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Company     1960 non-null   object
 1   Title       1960 non-null   object
 2   Location    1960 non-null   object
 3   Type        1960 non-null   object
 4   level       1960 non-null   object
 5   Salary      1960 non-null   int64
 6   Requirment  1960 non-null   object
 7   Facilities  1960 non-null   object
 8   Country     1960 non-null   object
 9   cluster     1960 non-null   object
 10  x0          1960 non-null   float64
 11  x1          1960 non-null   float64
 12  classe      1960 non-null   object
dtypes: float64(2), int64(1), object(10)
memory usage: 199.2+ KB

In [855]:
len(df['Requirment'].unique())

1741

In [856]:
import pandas as pd
import pyodbc

# Replace the connection string with your actual SQL Server connection string
conn_str = 'DRIVER={SQL Server};SERVER=LAPTOP-REU1GLF5\SQLEXPRESS;DATABASE=Jobs'

# Establish a connection to the database
conn = pyodbc.connect(conn_str)
cursor = conn.cursor()

In [857]:
cursor.execute("IF OBJECT_ID('company_jobs', 'U') IS NOT NULL DROP TABLE company_jobs")
cursor.execute("IF OBJECT_ID('needs', 'U') IS NOT NULL DROP TABLE needs")
cursor.execute("IF OBJECT_ID('Requirement', 'U') IS NOT NULL DROP TABLE Requirement")
cursor.execute("IF OBJECT_ID('Description', 'U') IS NOT NULL DROP TABLE Description")
cursor.execute("IF OBJECT_ID('Jobs', 'U') IS NOT NULL DROP TABLE Jobs")
cursor.execute("IF OBJECT_ID('company_location', 'U') IS NOT NULL DROP TABLE company_location")
cursor.execute("IF OBJECT_ID('Location', 'U') IS NOT NULL DROP TABLE Location")
cursor.execute("IF OBJECT_ID('Company', 'U') IS NOT NULL DROP TABLE Company")

conn.commit()

In [858]:
# Create the Languages table if it doesn't exist
cursor.execute('''
CREATE TABLE Company (
    company_id INT PRIMARY KEY,
    company_name VARCHAR(100)
)
''')
conn.commit()

In [859]:
unique_company = df['Company'].unique()
for idx, company in enumerate(unique_company):
    cursor.execute("INSERT INTO Company (company_id, company_name) VALUES (?, ?)", idx + 1, company)
    conn.commit()

In [860]:
# Create the Languages table if it doesn't exist
cursor.execute('''
CREATE TABLE Location (
    country_id INT PRIMARY KEY,
    country_name VARCHAR(50)
)
''')
conn.commit()

In [861]:
unique_country = df['Country'].unique()
for idx, country in enumerate(unique_country):
    cursor.execute("INSERT INTO Location (country_id, country_name) VALUES (?, ?)", idx + 1, country)
    conn.commit()

In [862]:
# Create the Repository_Languages table with foreign keys to Repositories and Languages tables
cursor.execute('''
CREATE TABLE company_location (
    company_id INT,
    country_id INT,
    PRIMARY KEY (company_id, country_id),
    FOREIGN KEY (company_id) REFERENCES Company(company_id),
    FOREIGN KEY (country_id) REFERENCES Location(country_id)
)
''')
conn.commit()

In [863]:
df1 = df[["Company", "Country"]]

In [864]:
unique_country = pd.DataFrame(unique_country)
unique_company = pd.DataFrame(unique_company)

In [865]:
unique_country.reset_index(inplace=True)
unique_company.reset_index(inplace=True)

In [866]:
unique_country.rename(columns={"index":"country_id", 0:"Country"}, inplace=True)
unique_company.rename(columns={"index":"company_id", 0:"Company"}, inplace=True)

In [867]:
unique_country["country_id"] = unique_country["country_id"] + 1
unique_company["company_id"] = unique_company["company_id"] + 1

In [868]:
unique_country

     country_id               Country
0             1         United States
1             2              Portugal
2             3           Switzerland
3             4                 India
4             5               Germany
..          ...                   ...
184         185               Tallinn
185         186              Colombia
186         187  New York City/Remote
187         188       United Kingdom,
188         189              Tel-Aviv

[189 rows x 2 columns]

In [869]:
unique_company

     company_id              Company
0             1      Publicis Groupe
1             2           ServiceNow
2             3  Natixis in Portugal
3             4   Palo Alto Networks
4             5                 CERN
..          ...                  ...
795         796              23andMe
796         797               WITHIN
797         798             DrDoctor
798         799               Thaloz
799         800            Rackspace

[800 rows x 2 columns]

In [870]:
result_df = pd.merge(df1, unique_country, on='Country', how='left')

In [871]:
result_df = pd.merge(result_df, unique_company, on='Company', how='left')

In [872]:
result_df

                  Company        Country  country_id  company_id
0         Publicis Groupe  United States           1           1
1              ServiceNow  United States           1           2
2     Natixis in Portugal       Portugal           2           3
3      Palo Alto Networks  United States           1           4
4                    CERN    Switzerland           3           5
...                   ...            ...         ...         ...
1955                 CCRi  United States           1         215
1956      Publicis Groupe  United States           1           1
1957             DoorDash       New York          19         433
1958      Western Digital    Philippines          49          15
1959        ATB Financial         Canada          17         498

[1960 rows x 4 columns]

In [873]:
comp_loc_data = []
for row in result_df.itertuples(index=False):
    country_id = row.country_id
    company_id = row.company_id
    comp_loc_data.append((country_id, company_id))

In [874]:
print(comp_loc_data)

[(1, 1), (1, 2), (2, 3), (1, 4), (3, 5), (4, 6), (2, 7), (5, 7), (1, 2), (1, 8), (6, 9), (4, 10), (1, 7), (1, 11), (1, 1), (7, 12), (8, 13), (9, 14), (10, 15), (11, 16), (1, 17), (4, 10), (5, 18), (12, 19), (1, 20), (1, 21), (13, 22), (4, 23), (14, 24), (1, 25), (1, 26), (14, 27), (8, 7), (15, 28), (1, 29), (1, 30), (1, 31), (1, 32), (16, 33), (1, 34), (1, 35), (14, 7), (1, 36), (1, 37), (17, 38), (18, 39), (6, 40), (19, 41), (1, 42), (5, 43), (20, 44), (21, 45), (22, 46), (1, 1), (23, 47), (1, 31), (1, 36), (22, 46), (1, 17), (1, 10), (24, 48), (25, 49), (24, 48), (17, 50), (4, 51), (1, 29), (1, 52), (26, 53), (1, 35), (5, 54), (27, 55), (28, 56), (1, 17), (6, 57), (1, 1), (14, 58), (1, 59), (20, 44), (1, 60), (29, 61), (30, 62), (1, 12), (1, 2), (1, 63), (1, 64), (12, 19), (31, 65), (1, 21), (4, 37), (1, 66), (1, 67), (14, 68), (6, 69), (1, 1), (1, 70), (2, 7), (24, 48), (1, 71), (11, 72), (4, 6), (32, 73), (33, 74), (14, 70), (14, 75), (5, 16), (1, 76), (17, 12), (34, 77), (1, 78), (17, 79), (1, 37), (24, 48), (5, 80), (35, 81), (36, 82), (4, 83), (1, 84), (1, 47), (14, 85), (37, 86), (1, 1), (38, 87), (14, 88), (1, 10), (1, 37), (39, 89), (7, 90), (1, 37), (40, 91), (1, 92), (4, 93), (1, 84), (1, 25), (4, 94), (6, 4), (41, 56), (11, 95), (4, 96), (22, 97), (14, 98), (1, 99), (1, 1), (42, 100), (43, 101), (44, 102), (1, 103), (45, 104), (6, 40), (1, 71), (4, 105), (46, 106), (1, 107), (47, 108), (48, 109), (10, 110), (5, 1), (17, 111), (49, 112), (49, 112), (50, 113), (33, 74), (1, 7), (51, 114), (52, 115), (1, 116), (14, 46), (33, 117), (4, 7), (53, 118), (54, 119), (1, 120), (10, 121), (4, 122), (55, 123), (47, 124), (1, 1), (1, 125), (1, 126), (14, 127), (56, 128), (6, 123), (14, 129), (5, 130), (17, 131), (57, 132), (18, 39), (1, 133), (1, 134), (1, 35), (14, 135), (9, 136), (1, 137), (58, 138), (14, 139), (17, 140), (4, 141), (59, 7), (1, 131), (22, 46), (60, 142), (1, 143), (61, 35), (1, 1), (11, 144), (1, 145), (1, 146), (9, 147), (2, 3), (5, 7), (8, 148), (28, 56), (4, 141), (14, 58), (1, 92), (4, 149), (4, 2), (1, 150), (1, 151), (1, 152), (1, 153), (14, 154), (1, 155), (14, 24), (10, 121), (62, 115), (1, 156), (1, 1), (37, 157), (1, 35), (1, 37), (5, 7), (5, 158), (47, 124), (14, 159), (1, 160), (14, 161), (63, 162), (64, 163), (53, 164), (1, 107), (14, 165), (65, 166), (1, 153), (66, 167), (43, 101), (1, 10), (59, 16), (1, 4), (1, 99), (1, 137), (20, 168), (67, 169), (1, 12), (59, 16), (6, 170), (14, 171), (2, 172), (14, 173), (14, 174), (1, 175), (18, 39), (3, 176), (68, 177), (1, 46), (1, 36), (49, 178), (55, 179), (1, 12), (18, 39), (4, 180), (1, 12), (9, 28), (17, 181), (1, 182), (7, 29), (1, 183), (69, 184), (1, 185), (1, 186), (1, 187), (1, 154), (6, 188), (14, 58), (17, 111), (19, 189), (1, 2), (66, 1), (5, 190), (57, 132), (46, 191), (70, 38), (1, 12), (14, 192), (71, 129), (18, 39), (1, 29), (72, 193), (1, 194), (24, 195), (17, 196), (19, 197), (1, 198), (1, 1), (1, 199), (1, 96), (1, 200), (14, 201), (7, 149), (46, 202), (46, 72), (1, 203), (8, 204), (14, 205), (4, 2), (7, 90), (5, 190), (4, 206), (1, 207), (5, 7), (28, 208), (14, 209), (28, 210), (11, 72), (1, 211), (5, 7), (73, 212), (1, 185), (17, 213), (74, 100), (17, 90), (14, 214), (4, 10), (7, 90), (5, 101), (1, 215), (14, 216), (14, 217), (64, 110), (4, 37), (1, 218), (75, 219), (46, 202), (52, 115), (14, 220), (14, 221), (76, 222), (1, 223), (77, 224), (11, 225), (17, 147), (7, 226), (1, 227), (10, 15), (1, 29), (1, 7), (4, 176), (1, 228), (1, 7), (5, 229), (1, 10), (28, 210), (5, 230), (5, 231), (6, 232), (78, 233), (17, 234), (1, 25), (14, 221), (1, 235), (79, 236), (1, 1), (14, 237), (5, 18), (1, 29), (7, 226), (80, 79), (81, 238), (76, 222), (6, 6), (4, 239), (17, 147), (1, 240), (5, 231), (6, 241), (1, 242), (1, 243), (1, 37), (46, 202), (63, 244), (82, 25), (1, 245), (80, 79), (4, 7), (1, 246), (1, 245), (1, 247), (1, 248), (17, 51), (80, 79), (5, 130), (17, 147), (1, 7), (4, 1), (23, 235), (14, 249), (1, 1), (6, 40), (1, 10), (1, 7), (66, 167), (1, 250), (14, 98), (22, 46), (9, 51), (1, 251), (1, 1), (1, 4), (46, 11), (1, 252), (37, 86), (83, 8), (80, 253), (37, 86), (1, 66), (84, 254), (1, 255), (85, 256), (55, 257), (1, 35), (28, 210), (1, 25), (46, 258), (1, 242), (17, 259), (1, 35), (1, 4), (1, 194), (14, 250), (4, 185), (71, 260), (1, 1), (14, 261), (1, 32), (1, 262), (16, 33), (1, 12), (1, 242), (1, 263), (43, 264), (1, 2), (1, 126), (86, 265), (7, 266), (43, 264), (37, 86), (81, 267), (87, 242), (66, 101), (80, 29), (17, 268), (46, 258), (5, 164), (1, 66), (6, 269), (1, 12), (1, 1), (1, 242), (1, 34), (14, 270), (1, 271), (1, 272), (88, 273), (36, 274), (1, 62), (1, 242), (1, 242), (15, 28), (46, 72), (1, 120), (1, 242), (89, 275), (7, 113), (6, 276), (1, 277), (1, 242), (46, 72), (24, 22), (1, 2), (90, 278), (1, 1), (1, 12), (4, 6), (4, 2), (14, 1), (91, 37), (14, 279), (37, 86), (14, 280), (92, 35), (1, 120), (1, 51), (1, 25), (71, 281), (4, 2), (6, 282), (14, 93), (1, 30), (1, 37), (14, 283), (14, 284), (93, 235), (1, 242), (1, 36), (1, 35), (1, 242), (5, 41), (5, 231), (1, 285), (17, 2), (1, 250), (1, 12), (7, 286), (4, 180), (63, 1), (1, 185), (5, 231), (10, 287), (19, 288), (94, 54), (8, 172), (1, 35), (5, 289), (49, 290), (95, 291), (1, 1), (84, 254), (1, 92), (96, 292), (1, 1), (1, 293), (37, 86), (14, 294), (59, 295), (1, 10), (6, 296), (1, 35), (1, 240), (7, 7), (33, 297), (97, 298), (34, 154), (1, 299), (58, 300), (17, 301), (14, 302), (1, 28), (14, 303), (1, 35), (9, 7), (1, 304), (1, 305), (1, 242), (4, 37), (1, 110), (9, 306), (1, 12), (98, 307), (1, 308), (1, 51), (1, 126), (46, 309), (17, 310), (17, 147), (4, 250), (28, 210), (71, 311), (99, 110), (8, 46), (1, 105), (4, 122), (100, 218), (85, 312), (2, 313), (1, 314), (4, 315), (59, 7), (1, 242), (8, 204), (101, 316), (81, 238), (102, 317), (5, 7), (96, 318), (103, 319), (83, 320), (14, 8), (104, 321), (105, 183), (14, 173), (59, 7), (46, 322), (14, 7), (1, 323), (28, 210), (87, 117), (53, 164), (1, 4), (1, 51), (1, 12), (93, 235), (1, 324), (4, 325), (44, 326), (1, 327), (5, 7), (14, 328), (1, 329), (1, 35), (1, 329), (45, 104), (1, 12), (11, 330), (22, 37), (1, 250), (1, 331), (1, 35), (4, 10), (106, 332), (8, 46), (1, 222), (22, 333), (5, 7), (46, 334), (4, 10), (101, 335), (4, 10), (4, 336), (9, 51), (1, 99), (1, 107), (53, 337), (4, 10), (2, 172), (5, 7), (1, 326), (1, 338), (107, 339), (14, 339), (1, 338), (1, 2), (6, 9), (108, 340), (9, 250), (1, 341), (14, 342), (1, 35), (1, 153), (10, 15), (4, 10), (1, 4), (1, 343), (1, 344), (1, 327), (4, 10), (5, 7), (1, 1), (17, 345), (107, 339), (1, 207), (1, 271), (1, 346), (48, 347), (11, 348), (1, 349), (1, 350), (96, 163), (1, 49), (4, 351), (8, 13), (9, 51), (1, 2), (14, 352), (17, 353), (9, 354), (46, 355), (4, 1), (4, 356), (72, 193), (17, 1), (27, 357), (1, 51), (14, 358), (109, 359), (1, 296), (1, 360), (14, 361), (56, 7), (14, 362), (8, 363), (4, 2), (46, 364), (14, 159), (110, 365), (4, 250), (1, 12), (14, 366), (111, 49), (1, 1), (1, 126), (112, 137), (1, 207), (14, 367), (1, 368), (1, 369), (4, 88), (14, 370), (1, 243), (6, 40), (5, 18), (14, 371), (8, 372), (1, 35), (48, 373), (64, 374), (1, 375), (113, 234), (114, 376), (46, 377), (14, 378), (85, 379), (115, 380), (106, 381), (1, 92), (4, 10), (106, 381), (116, 382), (44, 383), (8, 384), (1, 298), (117, 89), (97, 385), (14, 386), (93, 235), (4, 6), (46, 273), (1, 35), (117, 387), (1, 388), (106, 389), (118, 390), (65, 391), (5, 392), (24, 156), (14, 284), (119, 393), (7, 394), (1, 395), (97, 396), (1, 397), (120, 398), (11, 135), (2, 399), (6, 400), (4, 401), (1, 402), (4, 88), (1, 35), (1, 84), (106, 389), (1, 403), (1, 2), (10, 15), (6, 276), (1, 1), (1, 1), (53, 164), (6, 170), (1, 1), (1, 245), (117, 404), (4, 405), (104, 406), (14, 1), (1, 1), (1, 407), (5, 230), (1, 1), (4, 1), (121, 167), (7, 51), (17, 12), (1, 290), (6, 170), (14, 7), (14, 249), (1, 408), (36, 409), (1, 194), (122, 104), (123, 326), (6, 241), (17, 79), (1, 1), (49, 410), (14, 411), (124, 412), (17, 79), (1, 99), (4, 413), (36, 409), (125, 414), (4, 336), (1, 12), (37, 415), (17, 416), (126, 417), (1, 1), (1, 248), (14, 362), (14, 48), (14, 418), (127, 419), (87, 420), (1, 332), (1, 51), (46, 421), (104, 422), (6, 241), (6, 40), (128, 423), (4, 424), (17, 425), (4, 426), (14, 427), (1, 375), (1, 250), (7, 12), (23, 235), (64, 428), (9, 429), (4, 430), (6, 431), (129, 233), (1, 432), (16, 306), (1, 34), (14, 154), (19, 433), (4, 401), (9, 434), (17, 435), (5, 18), (17, 79), (1, 250), (17, 50), (1, 436), (1, 1), (17, 425), (1, 437), (1, 4), (14, 261), (4, 438), (1, 10), (17, 435), (28, 210), (1, 1), (1, 439), (1, 1), (130, 440), (125, 414), (1, 441), (1, 442), (1, 200), (6, 123), (1, 243), (5, 443), (5, 443), (1, 444), (1, 445), (110, 446), (1, 248), (131, 447), (17, 245), (14, 448), (1, 449), (1, 450), (1, 451), (5, 7), (28, 452), (1, 228), (1, 215), (104, 374), (1, 12), (14, 453), (49, 181), (17, 454), (14, 173), (1, 242), (14, 448), (14, 362), (10, 250), (132, 455), (14, 456), (1, 35), (59, 149), (1, 379), (97, 457), (1, 68), (1, 458), (1, 250), (4, 325), (4, 459), (133, 51), (28, 210), (134, 460), (1, 11), (1, 461), (1, 375), (6, 462), (135, 126), (1, 250), (11, 463), (1, 134), (1, 12), (17, 464), (1, 305), (6, 269), (1, 35), (1, 12), (11, 465), (1, 466), (1, 467), (1, 468), (1, 305), (1, 36), (4, 10), (30, 99), (4, 6), (1, 469), (48, 347), (136, 308), (137, 470), (19, 288), (136, 471), (2, 85), (4, 122), (1, 194), (1, 199), (4, 2), (1, 35), (14, 472), (1, 473), (14, 474), (8, 10), (1, 242), (5, 16), (14, 51), (1, 12), (1, 250), (1, 475), (113, 476), (11, 22), (138, 233), (4, 10), (4, 37), (71, 72), (46, 477), (76, 222), (6, 12), (7, 478), (113, 479), (136, 471), (97, 480), (1, 481), (14, 384), (1, 235), (17, 287), (97, 482), (64, 51), (1, 483), (1, 484), (8, 204), (139, 485), (17, 345), (1, 486), (1, 8), (1, 35), (82, 487), (49, 10), (64, 488), (10, 121), (140, 212), (8, 172), (97, 489), (1, 8), (1, 273), (30, 490), (1, 379), (5, 190), (14, 228), (4, 491), (28, 492), (1, 493), (1, 475), (2, 494), (113, 495), (14, 362), (17, 38), (4, 405), (4, 496), (14, 497), (5, 164), (17, 498), (71, 499), (10, 121), (46, 500), (14, 501), (1, 502), (113, 239), (56, 7), (37, 503), (14, 504), (83, 35), (1, 12), (64, 110), (46, 505), (46, 506), (80, 346), (56, 7), (141, 507), (1, 10), (84, 254), (64, 110), (8, 508), (22, 46), (1, 509), (11, 22), (4, 510), (5, 511), (1, 29), (2, 3), (11, 512), (6, 513), (99, 514), (142, 511), (141, 507), (17, 515), (17, 516), (10, 517), (33, 518), (9, 14), (16, 519), (143, 520), (17, 38), (4, 521), (11, 512), (37, 415), (10, 121), (1, 194), (1, 522), (1, 523), (56, 7), (14, 524), (1, 341), (1, 525), (100, 243), (1, 523), (1, 194), (5, 101), (66, 101), (78, 523), (4, 1), (20, 526), (1, 527), (4, 7), (1, 194), (144, 528), (145, 529), (117, 530), (4, 521), (125, 531), (1, 194), (17, 532), (126, 417), (1, 305), (1, 533), (37, 415), (82, 534), (9, 535), (146, 485), (13, 536), (1, 522), (14, 386), (37, 415), (14, 524), (14, 537), (1, 293), (4, 538), (1, 235), (4, 7), (97, 15), (4, 1), (5, 231), (1, 10), (1, 51), (4, 250), (4, 1), (1, 10), (14, 11), (5, 231), (5, 231), (1, 445), (5, 7), (4, 539), (71, 540), (9, 429), (5, 230), (1, 305), (1, 541), (8, 542), (14, 543), (1, 1), (119, 544), (9, 545), (1, 546), (4, 1), (10, 15), (1, 1), (22, 97), (4, 547), (9, 7), (147, 336), (8, 542), (111, 8), (8, 542), (9, 7), (1, 548), (14, 549), (148, 485), (6, 48), (1, 548), (22, 97), (14, 181), (59, 149), (5, 230), (1, 12), (1, 12), (134, 550), (6, 9), (1, 35), (145, 551), (149, 81), (4, 552), (1, 207), (1, 493), (150, 11), (1, 12), (10, 15), (1, 4), (117, 553), (14, 46), (1, 345), (132, 455), (1, 1), (37, 86), (4, 554), (63, 555), (46, 501), (4, 38), (111, 8), (8, 542), (149, 81), (14, 556), (9, 557), (1, 407), (4, 395), (8, 558), (129, 427), (1, 1), (1, 310), (9, 559), (56, 128), (117, 560), (2, 263), (1, 561), (14, 562), (4, 563), (14, 564), (46, 322), (151, 153), (5, 443), (152, 565), (4, 37), (107, 339), (153, 566), (5, 231), (1, 228), (5, 231), (1, 51), (154, 567), (1, 568), (1, 35), (1, 36), (4, 236), (26, 569), (1, 570), (4, 571), (17, 38), (1, 35), (1, 572), (28, 573), (1, 251), (4, 236), (5, 574), (3, 575), (1, 576), (1, 577), (155, 231), (3, 355), (156, 578), (10, 121), (1, 314), (1, 290), (1, 579), (4, 4), (8, 172), (1, 580), (1, 290), (4, 581), (155, 231), (43, 582), (80, 228), (14, 98), (14, 489), (1, 407), (3, 575), (93, 235), (22, 46), (7, 7), (28, 210), (17, 583), (2, 3), (11, 463), (92, 35), (2, 85), (1, 273), (4, 10), (14, 237), (1, 35), (9, 51), (117, 584), (1, 126), (157, 585), (154, 586), (116, 382), (1, 35), (1, 587), (92, 35), (37, 415), (1, 588), (1, 589), (4, 590), (1, 126), (1, 125), (9, 7), (71, 48), (1, 548), (6, 591), (97, 457), (1, 592), (5, 7), (72, 593), (1, 466), (17, 97), (17, 594), (4, 236), (37, 595), (158, 596), (17, 583), (14, 93), (117, 597), (14, 598), (80, 272), (4, 10), (14, 599), (1, 600), (125, 414), (1, 601), (9, 7), (1, 602), (64, 110), (10, 287), (14, 237), (159, 236), (1, 483), (17, 583), (8, 508), (2, 85), (14, 98), (18, 384), (10, 1), (4, 603), (14, 8), (1, 1), (1, 10), (160, 604), (28, 573), (48, 373), (117, 605), (47, 606), (4, 607), (142, 511), (131, 608), (45, 609), (1, 1), (4, 122), (1, 155), (97, 610), (10, 1), (78, 611), (1, 35), (3, 355), (117, 426), (10, 1), (1, 612), (1, 1), (3, 575), (5, 613), (1, 12), (161, 386), (1, 12), (1, 403), (6, 614), (14, 615), (14, 98), (14, 616), (1, 1), (9, 617), (106, 381), (14, 426), (1, 514), (81, 618), (24, 619), (117, 620), (1, 1), (34, 126), (1, 35), (14, 621), (14, 622), (9, 10), (162, 623), (1, 35), (1, 624), (47, 625), (1, 29), (145, 529), (1, 218), (33, 626), (4, 7), (1, 627), (37, 86), (163, 628), (99, 110), (1, 566), (1, 1), (60, 380), (14, 98), (1, 402), (1, 629), (17, 630), (17, 594), (24, 631), (164, 173), (115, 380), (1, 35), (60, 380), (165, 376), (1, 632), (93, 235), (14, 633), (17, 594), (166, 627), (14, 634), (7, 90), (1, 635), (8, 636), (33, 626), (64, 1), (1, 35), (60, 380), (11, 295), (1, 637), (56, 128), (4, 594), (166, 638), (4, 639), (14, 640), (60, 380), (14, 641), (4, 141), (1, 642), (17, 268), (14, 641), (1, 643), (17, 28), (1, 644), (28, 210), (44, 461), (1, 35), (1, 310), (5, 645), (1, 646), (28, 647), (167, 648), (14, 649), (168, 233), (14, 171), (80, 272), (1, 35), (1, 650), (1, 651), (74, 100), (1, 510), (1, 652), (1, 653), (1, 305), (5, 164), (1, 1), (17, 353), (1, 405), (14, 1), (14, 249), (1, 104), (14, 654), (1, 12), (6, 1), (46, 202), (1, 29), (169, 655), (36, 409), (170, 656), (147, 657), (171, 658), (172, 659), (129, 657), (6, 10), (34, 660), (1, 12), (122, 295), (37, 661), (172, 662), (173, 461), (1, 12), (1, 29), (56, 128), (169, 655), (2, 7), (174, 658), (23, 35), (175, 663), (1, 118), (4, 250), (1, 251), (176, 664), (169, 655), (6, 276), (5, 231), (172, 662), (17, 665), (14, 666), (14, 362), (1, 667), (1, 339), (1, 668), (28, 210), (129, 657), (3, 575), (6, 296), (171, 658), (1, 46), (1, 463), (24, 441), (1, 2), (4, 172), (4, 250), (1, 496), (14, 250), (169, 655), (172, 662), (169, 655), (3, 575), (1, 8), (5, 669), (1, 601), (170, 663), (169, 655), (169, 655), (6, 241), (169, 655), (1, 35), (117, 670), (1, 248), (170, 656), (171, 658), (36, 671), (170, 656), (1, 375), (14, 672), (14, 673), (83, 663), (1, 35), (1, 674), (48, 11), (1, 1), (1, 12), (166, 675), (1, 525), (4, 2), (14, 676), (46, 72), (177, 677), (1, 678), (1, 248), (1, 47), (64, 679), (1, 100), (1, 680), (16, 33), (14, 681), (4, 10), (46, 72), (7, 212), (1, 682), (9, 683), (24, 684), (178, 300), (8, 124), (12, 514), (110, 365), (179, 685), (19, 77), (1, 686), (14, 687), (5, 72), (1, 47), (1, 688), (1, 346), (47, 689), (2, 7), (6, 9), (1, 690), (1, 403), (14, 691), (1, 310), (131, 10), (2, 3), (45, 609), (4, 126), (43, 692), (14, 1), (56, 128), (4, 88), (17, 111), (17, 310), (10, 121), (4, 693), (4, 571), (56, 7), (1, 51), (1, 35), (1, 694), (17, 695), (1, 688), (46, 501), (46, 696), (4, 405), (47, 697), (1, 1), (22, 46), (1, 698), (1, 29), (14, 699), (37, 415), (180, 700), (80, 701), (2, 3), (1, 346), (1, 702), (93, 235), (17, 703), (1, 46), (5, 231), (1, 704), (37, 415), (20, 35), (4, 93), (1, 705), (14, 287), (14, 706), (1, 11), (1, 542), (1, 228), (147, 336), (37, 415), (1, 338), (37, 415), (1, 2), (1, 310), (4, 172), (115, 380), (14, 707), (1, 708), (1, 338), (5, 164), (14, 46), (6, 591), (1, 183), (97, 306), (4, 491), (4, 122), (1, 496), (71, 441), (71, 48), (17, 310), (1, 709), (56, 132), (5, 231), (14, 497), (181, 710), (1, 502), (71, 505), (17, 38), (97, 41), (1, 12), (4, 711), (37, 415), (4, 590), (8, 250), (1, 433), (3, 712), (1, 576), (14, 46), (14, 283), (1, 344), (1, 678), (71, 48), (43, 713), (14, 537), (1, 194), (1, 250), (2, 172), (1, 250), (5, 289), (9, 213), (178, 300), (117, 714), (1, 35), (14, 24), (4, 122), (1, 715), (37, 415), (117, 716), (37, 415), (1, 717), (1, 12), (1, 433), (117, 716), (182, 718), (1, 678), (1, 1), (40, 91), (154, 567), (1, 719), (1, 720), (1, 35), (14, 721), (5, 463), (29, 483), (17, 722), (17, 723), (37, 415), (37, 415), (1, 724), (1, 35), (14, 46), (4, 185), (1, 187), (1, 501), (1, 250), (183, 725), (5, 289), (1, 726), (1, 11), (71, 48), (1, 709), (37, 415), (5, 727), (1, 29), (1, 12), (6, 132), (71, 48), (4, 2), (1, 728), (31, 65), (27, 729), (1, 730), (17, 731), (147, 732), (1, 702), (46, 733), (184, 734), (14, 1), (1, 735), (14, 622), (4, 736), (1, 12), (14, 453), (14, 622), (1, 228), (1, 737), (1, 738), (43, 593), (1, 739), (4, 93), (62, 46), (9, 740), (6, 513), (1, 741), (23, 660), (1, 737), (5, 742), (1, 1), (46, 500), (1, 739), (4, 438), (1, 561), (5, 230), (1, 126), (14, 27), (14, 743), (14, 744), (1, 745), (1, 719), (1, 4), (97, 610), (1, 739), (1, 12), (5, 7), (1, 37), (46, 746), (1, 1), (97, 747), (80, 98), (14, 748), (1, 403), (60, 380), (1, 749), (17, 51), (1, 4), (4, 10), (1, 647), (54, 750), (5, 231), (1, 10), (1, 737), (1, 4), (14, 751), (14, 85), (1, 739), (1, 310), (4, 438), (1, 47), (101, 752), (1, 561), (7, 90), (1, 47), (46, 85), (1, 753), (1, 25), (14, 754), (114, 755), (5, 756), (4, 603), (1, 757), (46, 85), (14, 743), (1, 758), (14, 1), (113, 759), (14, 641), (62, 46), (1, 642), (64, 760), (62, 46), (14, 129), (64, 761), (1, 762), (93, 235), (4, 426), (14, 763), (7, 90), (4, 764), (37, 86), (4, 7), (4, 765), (49, 766), (117, 605), (8, 358), (1, 749), (82, 767), (5, 164), (94, 768), (185, 769), (14, 279), (5, 770), (178, 771), (14, 772), (1, 243), (17, 583), (1, 223), (1, 773), (4, 395), (1, 20), (94, 768), (1, 35), (185, 769), (115, 380), (1, 774), (14, 775), (133, 113), (34, 77), (1, 776), (161, 777), (9, 649), (11, 463), (1, 762), (1, 778), (115, 380), (1, 103), (115, 380), (4, 405), (1, 215), (140, 779), (1, 774), (115, 380), (1, 776), (83, 780), (1, 781), (1, 1), (4, 7), (1, 758), (1, 758), (71, 72), (14, 754), (4, 330), (14, 556), (28, 210), (1, 51), (11, 16), (1, 1), (1, 29), (1, 12), (1, 66), (1, 250), (1, 51), (1, 66), (1, 782), (1, 10), (1, 783), (9, 136), (22, 97), (17, 784), (22, 97), (186, 1), (62, 46), (14, 51), (17, 245), (1, 785), (2, 7), (4, 6), (130, 440), (80, 141), (187, 786), (5, 645), (1, 787), (11, 184), (14, 788), (14, 10), (14, 641), (3, 338), (14, 789), (56, 128), (187, 786), (1, 1), (17, 353), (3, 575), (59, 790), (2, 7), (71, 791), (92, 35), (107, 787), (7, 792), (14, 173), (28, 210), (70, 663), (107, 787), (119, 793), (40, 91), (2, 399), (188, 412), (43, 10), (28, 210), (1, 794), (1, 12), (4, 10), (4, 7), (189, 795), (14, 64), (125, 531), (1, 796), (17, 10), (1, 35), (7, 797), (14, 798), (1, 37), (1, 379), (1, 375), (14, 489), (1, 245), (116, 382), (1, 667), (46, 355), (28, 210), (64, 1), (186, 799), (14, 598), (14, 663), (1, 305), (104, 7), (45, 609), (168, 233), (83, 663), (4, 800), (23, 272), (63, 1), (2, 70), (1, 314), (1, 287), (14, 427), (113, 427), (14, 85), (1, 427), (1, 2), (2, 460), (1, 85), (1, 215), (1, 1), (19, 433), (49, 15), (17, 498)]

In [875]:
print(len(comp_loc_data))

1960

In [876]:
comp_loc = list(set(comp_loc_data))

In [877]:
print(len(comp_loc))

1061

In [817]:
  for data in comp_loc:
    cursor.execute("INSERT INTO company_location (country_id, company_id) VALUES (?, ?)", data[0], data[1])
    conn.commit()

In [818]:
df2 = df[['Title', 'Type', 'Salary']]

In [819]:
df2

                                                  Title       Type  Salary
0                 data engineer full time public sector  Full Time     108
1                                        data scientist  Full Time     184
2                   vendor management data quality lead  Full Time      39
3           principal cloud data engineer prisma access  Full Time     140
4                                   data scientist grap  Full Time      40
...                                                 ...        ...     ...
1955  application integration engineer computer visi...  Full Time     113
1956                             associate data science  Full Time     106
1957    software engineer machine learning intelligence  Full Time     176
1958                    data scientist college graduate  Full Time      39
1959                                     data scientist  Full Time      39

[1960 rows x 3 columns]

In [820]:
unique_jobs = df2['Title'].unique()

In [821]:
unique_jobs = pd.DataFrame(unique_jobs)
unique_jobs.reset_index(inplace=True)
unique_jobs.rename(columns={"index":"jobs_id", 0:"Title"}, inplace=True)
unique_jobs["jobs_id"] = unique_jobs["jobs_id"] + 1
unique_jobs

      jobs_id                                              Title
0           1              data engineer full time public sector
1           2                                     data scientist
2           3                vendor management data quality lead
3           4        principal cloud data engineer prisma access
4           5                                data scientist grap
...       ...                                                ...
1142     1143                             people data specialist
1143     1144            machine learning engineer trip planning
1144     1145  application integration engineer computer visi...
1145     1146    software engineer machine learning intelligence
1146     1147                    data scientist college graduate

[1147 rows x 2 columns]

In [822]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Jobs (
    job_id INT PRIMARY KEY,
    Title VARCHAR(100)
)
''')
conn.commit()

In [823]:
# Insert data into the table
for row in unique_jobs.itertuples(index=False):
    cursor.execute("INSERT INTO Jobs (job_id, Title) VALUES (?, ?)", 
                   row.jobs_id, row.Title)
    conn.commit()

In [824]:
jobs_company = pd.merge(unique_jobs, df, on='Title', how='left')

In [825]:
jobs_company

,jobs_id,Title,Company,Location,Type,level,Salary,Requirment,Facilities,Country,cluster,x0,x1,classe
0,1,data engineer full time public sector,Publicis Groupe,"Arlington, VA, United States",Full Time,Intermediate,108,aws azure computer science consulting dataflow...,flex hours flex vacation parental leave unlimi...,United States,Cloud Computing and Data Science,-0.173533,-0.186278,Cloud Computing and Data Science
1,2,data scientist,ServiceNow,"Kirkland, Washington, United States",Full Time,Senior,184,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Machine Learning and Computer Vision,0.403370,-0.192080,Machine Learning and Computer Vision
2,2,data scientist,ServiceNow,"Kirkland, Washington, United States",Full Time,Senior,159,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Machine Learning and Computer Vision,0.403370,-0.192080,Machine Learning and Computer Vision
3,2,data scientist,Sunnova Energy International,United States,Full Time,Senior,129,agile apis architecture aws big data classific...,career development,United States,Cloud Computing and Data Science,-0.322585,-0.268335,Cloud Computing and Data Science
4,2,data scientist,Monzo,"Cardiff, London or Remote (UK)",Full Time,Senior,129,b testing banking data mining finance looker p...,career development conferences flex hours,United Kingdom,Data Visualization and Business Analytics,0.150805,0.201091,Data Visualization and Business Analytics
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1955,1143,people data specialist,Marley Spoon,"Lisbon, Lisbon, Portugal",Full Time,Intermediate,70,data analysis excel finance,career development equity flex hours flex vaca...,Portugal,Data Visualization and Business Analytics,0.063800,0.373096,Data Visualization and Business Analytics
1956,1144,machine learning engineer trip planning,TripAdvisor,"Needham, Massachusetts, MA",Full Time,Senior,170,big data computer science computer vision engi...,career development conferences flex hours flex...,United States,Data Visualization and Business Analytics,0.066309,-0.119690,Data Visualization and Business Analytics
1957,1145,application integration engineer computer visi...,CCRi,"Chantilly, Virginia, United States",Full Time,Intermediate,113,agile angular apis architecture aws azure,k matching career development flex hours flex ...,United States,Cloud Computing and Data Science,-0.247856,-0.327857,Cloud Computing and Data Science
1958,1146,software engineer machine learning intelligence,DoorDash,"Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior,176,computer science data analysis engineering exc...,k matching career development equity insurance...,New York,Data Visualization and Business Analytics,0.134893,0.079257,Data Visualization and Business Analytics
1959,1147,data scientist college graduate,Western Digital,"Biñan, Philippines",Full Time,Junior,39,apis clustering computer science data visualiz...,career development,Philippines,Machine Learning and Computer Vision,0.139047,-0.149278,Machine Learning and Computer Vision

In [826]:
jobs_company = pd.merge(jobs_company, unique_company, on='Company', how='left')

In [827]:
jobs_company.columns

Index(['jobs_id', 'Title', 'Company', 'Location', 'Type', 'level', 'Salary',
       'Requirment', 'Facilities', 'Country', 'cluster', 'x0', 'x1', 'classe',
       'company_id'],
      dtype='object')

In [828]:
jobs_company = jobs_company[["Title", "jobs_id", "Company", "company_id"]]

In [829]:
jobs_company

,Title,jobs_id,Company,company_id
0,data engineer full time public sector,1,Publicis Groupe,1
1,data scientist,2,ServiceNow,2
2,data scientist,2,ServiceNow,2
3,data scientist,2,Sunnova Energy International,21
4,data scientist,2,Monzo,24
...,...,...,...,...
1955,people data specialist,1143,Marley Spoon,460
1956,machine learning engineer trip planning,1144,TripAdvisor,85
1957,application integration engineer computer visi...,1145,CCRi,215
1958,software engineer machine learning intelligence,1146,DoorDash,433
1959,data scientist college graduate,1147,Western Digital,15

In [830]:
# Create the Repository_Languages table with foreign keys to Repositories and Languages tables
cursor.execute('''
CREATE TABLE company_jobs (
    company_id INT,
    job_id INT,
    PRIMARY KEY (company_id, job_id),
    FOREIGN KEY (company_id) REFERENCES Company(company_id),
    FOREIGN KEY (job_id) REFERENCES Jobs(job_id)
)
''')
conn.commit()

In [831]:
comp_loc_data = []
for row in jobs_company.itertuples(index=False):
    job_id = row.jobs_id
    company_id = row.company_id
    comp_loc_data.append((job_id, company_id))

In [832]:
comp_loc = list(set(comp_loc_data))

In [833]:
for data in comp_loc:
    cursor.execute("INSERT INTO company_jobs (job_id, company_id) VALUES (?, ?)", data[0], data[1])
    conn.commit()

In [834]:
result_df2 = pd.merge(df2, unique_jobs, on='Title', how='left')

In [835]:
result_df2

,Title,Type,Salary,jobs_id
0,data engineer full time public sector,Full Time,108,1
1,data scientist,Full Time,184,2
2,vendor management data quality lead,Full Time,39,3
3,principal cloud data engineer prisma access,Full Time,140,4
4,data scientist grap,Full Time,40,5
...,...,...,...,...
1955,application integration engineer computer visi...,Full Time,113,1145
1956,associate data science,Full Time,106,502
1957,software engineer machine learning intelligence,Full Time,176,1146
1958,data scientist college graduate,Full Time,39,1147
1959,data scientist,Full Time,39,2

In [836]:
result_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1960 entries, 0 to 1959
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Title    1960 non-null   object
 1   Type     1960 non-null   object
 2   Salary   1960 non-null   int64
 3   jobs_id  1960 non-null   int64
dtypes: int64(2), object(2)
memory usage: 61.4+ KB

In [837]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Description (
    Type VARCHAR(50),
    Salary INT,
    job_id INT,
    FOREIGN KEY (job_id) REFERENCES Jobs(job_id)
)
''')
conn.commit()

# Insert data into the table
for row in result_df2.itertuples(index=False):
    cursor.execute("INSERT INTO Description (Type, Salary, job_id) VALUES (?, ?, ?)",
                   row.Type, row.Salary, row.jobs_id)
    conn.commit()

In [838]:
df.columns

Index(['Company', 'Title', 'Location', 'Type', 'level', 'Salary', 'Requirment',
       'Facilities', 'Country', 'cluster', 'x0', 'x1', 'classe'],
      dtype='object')

In [839]:
df3 = df[['level', 'Requirment', 'classe']]

In [840]:
unique_req = df3['Requirment'].unique()

In [841]:
unique_req = pd.DataFrame(unique_req)
unique_req.reset_index(inplace=True)
unique_req.rename(columns={"index":"req_id", 0:"Requirment"}, inplace=True)
unique_req["req_id"] = unique_req["req_id"] + 1
unique_req

      req_id                                         Requirment
0          1  aws azure computer science consulting dataflow...
1          2  computer science deep learning industrial mach...
2          3                banking data quality excel security
3          4     agile apis aws azure big data computer science
4          5  computer science data analysis deep learning k...
...      ...                                                ...
1736    1737  big data computer science computer vision engi...
1737    1738  bayesian classification clustering data analys...
1738    1739  computer science data analysis engineering exc...
1739    1740  apis clustering computer science data visualiz...
1740    1741  computer science data analytics data mining ec...

[1741 rows x 2 columns]

In [842]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Requirement (
    req_id INT PRIMARY KEY,
    requirement VARCHAR(500)
)
''')
conn.commit()

In [843]:
# Insert data into the table
for row in unique_req.itertuples(index=False):
    cursor.execute("INSERT INTO Requirement (req_id, requirement) VALUES (?, ?)", 
                   row.req_id, row.Requirment)
    conn.commit()

In [844]:
result_df3 = pd.merge(df3, unique_req, on='Requirment', how='left')

In [848]:
result_final = pd.merge(result_df3, df, on='Requirment', how='left')

In [849]:
result_final

,level_x,Requirment,classe_x,req_id,Company,Title,Location,Type,level_y,Salary,Facilities,Country,cluster,x0,x1,classe_y
0,Intermediate,aws azure computer science consulting dataflow...,Cloud Computing and Data Science,1,Publicis Groupe,data engineer full time public sector,"Arlington, VA, United States",Full Time,Intermediate,108,flex hours flex vacation parental leave unlimi...,United States,Cloud Computing and Data Science,-0.173533,-0.186278,Cloud Computing and Data Science
1,Senior,computer science deep learning industrial mach...,Machine Learning and Computer Vision,2,ServiceNow,data scientist,"Kirkland, Washington, United States",Full Time,Senior,184,k matching career development competitive pay ...,United States,Machine Learning and Computer Vision,0.403370,-0.192080,Machine Learning and Computer Vision
2,Senior,computer science deep learning industrial mach...,Machine Learning and Computer Vision,2,ServiceNow,data scientist,"Kirkland, Washington, United States",Full Time,Senior,159,k matching career development competitive pay ...,United States,Machine Learning and Computer Vision,0.403370,-0.192080,Machine Learning and Computer Vision
3,Junior,banking data quality excel security,Data Visualization and Business Analytics,3,Natixis in Portugal,vendor management data quality lead,"Porto, Portugal",Full Time,Junior,39,gear,Portugal,Data Visualization and Business Analytics,0.058230,0.232202,Data Visualization and Business Analytics
4,Senior,agile apis aws azure big data computer science,Cloud Computing and Data Science,4,Palo Alto Networks,principal cloud data engineer prisma access,"Santa Clara, CA, United States",Full Time,Senior,140,career development medical leave salary bonus ...,United States,Cloud Computing and Data Science,-0.418652,-0.378597,Cloud Computing and Data Science
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2497,Intermediate,agile angular apis architecture aws azure,Cloud Computing and Data Science,323,CCRi,application integration engineer computer visi...,"Chantilly, Virginia, United States",Full Time,Intermediate,113,k matching career development flex hours flex ...,United States,Cloud Computing and Data Science,-0.247856,-0.327857,Cloud Computing and Data Science
2498,Intermediate,bayesian classification clustering data analys...,Machine Learning and Computer Vision,1738,Publicis Groupe,associate data science,"New York City, United States",Full Time,Intermediate,106,career development health care,United States,Machine Learning and Computer Vision,0.238787,0.020648,Machine Learning and Computer Vision
2499,Senior,computer science data analysis engineering exc...,Data Visualization and Business Analytics,1739,DoorDash,software engineer machine learning intelligence,"Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior,176,k matching career development equity insurance...,New York,Data Visualization and Business Analytics,0.134893,0.079257,Data Visualization and Business Analytics
2500,Junior,apis clustering computer science data visualiz...,Machine Learning and Computer Vision,1740,Western Digital,data scientist college graduate,"Biñan, Philippines",Full Time,Junior,39,career development,Philippines,Machine Learning and Computer Vision,0.139047,-0.149278,Machine Learning and Computer Vision
2501,Junior,computer science data analytics data mining ec...,Data Visualization and Business Analytics,1741,ATB Financial,data scientist,"Edmonton, Alberta, Canada",Full Time,Junior,39,career development startup environment,Canada,Data Visualization and Business Analytics,0.023060,0.128025,Data Visualization and Business Analytics

In [846]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE needs (
    level VARCHAR(100),
    classe VARCHAR(50),
    req_id INT,
    FOREIGN KEY (req_id) REFERENCES Requirement(req_id)
)
''')
conn.commit()

In [847]:
# Insert data into the table
for row in result_df3.itertuples(index=False):
    cursor.execute("INSERT INTO needs (level, classe, req_id) VALUES (?, ?, ?)",
                   row.level, row.classe, row.req_id)
    conn.commit()